case/DNSCase01/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

// Domain: 0.05 x 0.10 x 0.05 m  (W x H x D)
// 25 x 50 x 25 cells → dx ~ 2mm (coarse DNS / fine LES)
vertices
(
    (0.00  0.00  0.00)   // 0
    (0.05  0.00  0.00)   // 1
    (0.05  0.10  0.00)   // 2
    (0.00  0.10  0.00)   // 3
    (0.00  0.00  0.05)   // 4
    (0.05  0.00  0.05)   // 5
    (0.05  0.10  0.05)   // 6
    (0.00  0.10  0.05)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 50 25) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 1 5 4));       // bottom — water injection
    }
    outlet
    {
        type patch;
        faces ((3 2 6 7));       // top — outflow
    }
    particleInlet
    {
        type patch;
        faces ((3 2 6 7));       // top — particle injection (same face, separate BC)
    }
    walls
    {
        type wall;
        faces
        (
            (0 3 7 4)            // left
            (1 2 6 5)            // right
            (0 1 2 3)            // front
            (4 5 6 7)            // back
        );
    }
);
